
### :heavy_check_mark: Terraform Format and Style 🎨
<details><summary>Logs</summary>
Output

```diff

```

Errors

```

```
</details> <!-- End Format Logs -->

### :heavy_check_mark: Terraform Initialization ⚙️
<details><summary>Logs</summary>
Output

```

[0m[1mInitializing the backend...[0m

[0m[1mInitializing provider plugins...[0m
- Finding linode/linode versions matching "1.24.0"...
- Finding latest version of hashicorp/local...
- Installing linode/linode v1.24.0...
- Installed linode/linode v1.24.0 (signed by a HashiCorp partner, key ID [0m[1mF4E6BBD0EA4FE463[0m[0m)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (signed by HashiCorp)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m

```

Errors

```

```
</details> <!-- End Init Logs -->

### :heavy_check_mark: Terraform Validation 🤖
<details><summary>Logs</summary>
Output

```
Success! The configuration is valid.


```

Errors

```

```
</details> <!-- End Validate Logs -->

### :heavy_check_mark: Terraform Plan 📖
<details><summary>Logs</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_lke_cluster.lke_cluster will be created
  + resource "linode_lke_cluster" "lke_cluster" {
      + api_endpoints = (known after apply)
      + id            = (known after apply)
      + k8s_version   = "1.23"
      + kubeconfig    = (sensitive value)
      + label         = "everonline"
      + region        = "eu-west"
      + status        = (known after apply)

      + control_plane {
          + high_availability = (known after apply)
        }

      + pool {
          + count = 1
          + id    = (known after apply)
          + nodes = (known after apply)
          + type  = "g6-standard-1"
        }
    }

  # local_file.kubeconfig will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "kube-config"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @everonline, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*